## 🇺🇦 **Українська версія**  

### 📝 Про себе  
Привіт! Мене звати Вадим, і я захоплююсь відеоіграми з дитинства.  
Натхнений інді-іграми, такими як **FEZ**, я вирішив зануритись у **розробку ігор**.  

**🔹 Досвід з Unity, C# та гейм-дизайном**  
**🔹 Розробляю власні проекти та вивчаю патерни проектування**  
**🔹 Відкритий до пропозицій про роботу (віддалено або в офісі)**  

---

## 📞 Контакти  
📞 +38 (093) 422-31-31  
💬 [Telegram](https://t.me/yourtelegram)  
✉️ [vadim.vatsenko@gmail.com](mailto:vadim.vatsenko@gmail.com)  
🔗 [GitHub](https://github.com/vadimvatsenko)  
🌍 Київ, Україна  

---

## 🚀 Проекти  

### 🎯 [Танки](https://github.com/vadimvatsenko/C_Charp_Tanks)  
🛠 **C#, Unity2D, AI, Pathfinding**  
🔥 Розробка **2D-ігри в стилі Battle City** з:  
✔ **ШІ ворогів**  
✔ **Алгоритм пошуку шляху**  
✔ **Зруйнованими та незруйнованими об'єктами**  
✔ **Фізикою зіткнень**  

---

## 🛠 Навички  

### 🎯 Технічні навички  
- C#  
- LinQ  
- SOLID  
- Unity  
- Анімація  
- Патерни  

### 🤝 Софт-скіли  
- Організованість  
- Трудолюбивість  
- Самостійність  
- Ввічливість  
- Спокійність  

### 🗣 Мови  
🇺🇦 Українська - рідна  
🇷🇺 Російська - рідна  
🇬🇧 Англійська - початковий  

---

## 💼 Досвід роботи  
🛒 **Самозайнятість – prodmag.com.ua**  
🚚 Доставка товарів в офіси  
📍 **Київ, 2014 – нині**  

---

## 🎓 Освіта  
🏫 **"Східноєвропейський університет ім. Рафа Аблязова"**  
📍 **Черкаси, Україна (2003 – 2007)**  
🎓 **Менеджер-економіст**  

---

## 📚 Додаткова освіта  
🏫 **IT School GoIT (Київ)**  
🗓 **Травень 2022 – Березень 2023**  
📜 **Full Stack Developer**  

---

⭐️ _Дякую, що завітали до мого профілю! Підписуйтесь на мої проекти_ 🚀
